<?php

  require('wxconfig.php');

  return array(
    // '配置项 '=>' 配置值'

    // +----------------------------------------------------------------------
    // | 数据库配置设定
    // +----------------------------------------------------------------------
    'DB_TYPE'               => 'mysql',                 // 数据库类型
    'DB_PREFIX'             => 'wxs_',                  // 数据库表前缀   ！开发时配置常量 ！
    'DB_CHARSET'            => 'utf8',                  // 数据库编码默认采用utf8
    // +----------------------------------------------------------------------
    // | 弹性WEB服务器和数据库
    // +----------------------------------------------------------------------
    //  'DB_HOST'           => 'rm-bp12j54a6nuw04l8t.mysql.rds.aliyuncs.com', // 服务器地址
    //  'DB_NAME'           => 'r6hpk2l184',            // 数据库名
    //  'DB_USER'           => 'r6hpk2l184',            // 用户名
    //  'DB_PWD'            => 'leren888_win',          // '1234QWERasdf', // 密码
    // +----------------------------------------------------------------------
    // | 本地测试服务器和数据库
    // +----------------------------------------------------------------------
    'DB_HOST'               => '127.0.0.1',             // 服务器地址
    'DB_NAME'               => 'wechat_shop',           // 数据库名
    'DB_PORT'               => '3306',                  // 端口，改为你自己的端口
    'DB_USER'               => DBConfig::DB_USER,       // 用户名
    'DB_PWD'                => DBConfig::DB_PWD,        // 数据库用户密码
  );
